public class Main
{
    public static void main(String[] args)
    {
        //Авиаперевозчики предлагают различные бонусные программы,
        // начисляющие бесплатные мили за перелёты.
        // Формула расчёта следующая: за каждые 20 рублей, потраченные на билет,
        // начисляется 1 миля. Дробные мили не начисляются.
        // Например, при стоимости билета в 13 676 рублей должно начислиться 683 бонусов.

        int ticket = 13676;     // вводим цену билета
        int mile = 20;     // количество рублей за одну начисленную милю.

        if (ticket <= 0) {
            System.out.println("Стоимость билета не може быть меньше нуля");
            return;
        }

        if (mile <= 0) {
            System.out.println("Количество рублей за начисленную милю не может быть меньше нуля");
            return;
        }

        int result = ticket / mile;
        System.out.println("Полученные мили: " + result);


    }
}